Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Shaders - 0
zh_cn: 着色器（Shaders） - 0

source: Should Background Images Be Shown: This option controls whether the selected background image should be shown or not.
zh_cn: 是否应该显示背景图（Should Background Images Be Shown）：该选项控制所选的背景图是否应该被显示。

source: Should new toolboxes collapse it you have a floating toolbox?: This option (which is on by default) will collapse the toolbox dock in any new editors that are open if you have "pulled" a toolbox out of an event to become a floating window.
zh_cn: 当你有一个浮动的工具箱时是否将其折叠？（Should new toolboxes collapse it you have a floating toolbox?）：当你将一个工具箱“拉”至一个事件之外并成为一个浮动的窗口时，这个选项（默认为开）将会在任何新编辑器中折叠工具箱栏。

source: Should the overview panel be collapsed by default?: Here you can choose to hide the overview panel of the Action Code Editor.
zh_cn: 概览面板是否默认被折叠？（Should the overview panel be collapsed by default?）：在这里你可以选择是否隐藏动作代码编辑器。

source: Show Remote Worker Installer - This will open a file explorer window on the location of the installer for the Remote Worker tool (see here for more information on Remote Workers).
zh_cn: 显示远程工作者安装程序 - 这将在远程工作者工具的安装程序的位置上打开文件资源管理器窗口（有关远程工作人员的详细信息，请参阅 此处）。

source: Show US spelling for system functions: By default GameMaker Studio 2 uses English spelling for functions, for example draw_text_colour, however this may not be exactly what you ar4e used to and so you can switch to US spellings using this option, so that the functions become draw_text_color, for example.
zh_cn: 显示系统函数的美式拼写（Show US spelling for system functions）：默认地，GameMaker Studio 2会显示函数的英式拼写，例如draw_text_colour，然而这可能不是你所习惯的拼写风格，因此你可以使用这个选项切换到美式拼写，这样一来，就会显示成draw_text_color了。

source: Show US spelling for system functions: By default GameMaker Studio 2 uses GB English spelling for functions, for example draw_text_colour, however this may not be exactly what you are used to and so you can switch to US spellings using this option, so that the functions become draw_text_color, for example.
zh_cn: 显示系统函数的美式拼写: 默认情况下 GameMaker Studio 2 使用英式英语拼写，例如 draw_text_colour ，然而你可能并不习惯，因此你可以切换到美式拼写，函数就会变成 draw_text_color。

source: Show Whitespace: Display "." to show whitespace (see image below).
zh_cn: 显示空白区域（彩色连续的英文句号）：显示“显示空白”（看下图）。

source: Show a message when exceeding physics vertex limit: This option can be used to control the pop up message that is shown when you exceed the permitted vertex number in the physics shape editor.
zh_cn: 当超过物理顶点限制显示一个消息（Show a message when exceeding physics vertex limit）：在物体形状编辑器中，当你超过允许的顶点数目限制时，这个选项将用来控制信息是否显示。

source: Show all compiler commands in compile window during compilation: This is checked by default and forces the compiler to show all relevant commands in the compile window.
zh_cn: 编译时在编译窗口中显示所有编译指令（Show all compiler commands in compile window during compilation）：该选项默认被勾选，并强制编译器在编译窗口中显示出所有的相关指令。

source: Show all verbose compiler commands: Checking this will force the compiler to show extra commands related to the compilation process.
zh_cn: 显示所有详细的编译指令（Show all verbose compiler commands）：勾选该项会强制编译器显示与编译进程相关的更多指令。

source: Show background images on workspaces: This option controls whether the selected background image should be shown or not.
zh_cn: 在工作区上显示背景图片: 此选项控制所选背景图片是否显示。

source: Show compiler commands in compile output: This is checked by default and forces the compiler to show all relevant commands in the compile window.
zh_cn: 在编译输出中显示编译器命令: 此选项默认勾选，此时编译器在编译窗口中会显示所有相关命令。

source: Show default help comment in new events?: By default this option is enabled and all it does is add a simple comment into the code editor for all new events to remind you that you can add your code there.
zh_cn: 新的事件显示默认的注释？（Show default help comment in new events?）：默认启用，它要做的是对于所有的新创建事件添加简单的注释到代码编辑器中，提醒你可以在这里添加代码。

source: Show group node icons: Enable or disable the icon representation of each resource type being displayed beside the resource name.
zh_cn: 显示组节点图标: 启用或禁用资源名称旁边显示的每个资源类型的图标。

source: Show horizontal separators: Here you can enable/disable the horizontal separators between different asset types in the resource tree.
zh_cn: 显示水平分割线: 您可以在此处启用/禁用资源树中不同资源类型之间的水平分隔符。

source: Show line numbers: Whether to show the line numbers down the left or not.
zh_cn: 显示行号：是否在最左侧显示行数。

source: Show package in explorer on build completion: Checking this will make GameMaker Studio 2 open the OS explorer window at the location where the final executable package has been created.
zh_cn: 构建完成时在 资源管理器中显示程序包: 勾选此选项时，GameMaker Studio 2 会在方程可执行文件包被创建时打开系统资源管理器窗口。

source: Show room views: If you have views active within a room, this is shown by an outline where the view boundaries would be within the room, and the visibility of this area can be toggled using the dedicated button in the editor itself.
zh_cn: 显示房间视野: 如果您在场景内观看视图，视图边界会在场景内显示，并且可以使用编辑器上的按钮切换该区域的边界的可见性。

source: Show tab lines: Display "...." to show tabbed space.
zh_cn: 显示tab对齐纵线：显示“....”以显示选项卡式的空间（原文有误，实际测试应该显示很多坚线，坚线间隔一个tab空间）。

source: Show the compile window during compilation: By default the compile window will be shown when you compile your projects, even if the compile doc is closed (it will open for the compile).
zh_cn: 在编译期间显示编译窗口：默认地，编译窗口会在你编译项目的时候被显示出来，即时在编译停靠栏已经关闭的时候（编译的时候再打开）。

source: Show tree lines: Here you can enable/disable the tree lines that are shown to the side of assets in the resource tree.
zh_cn: 显示树状线: 你可以在此处启用/禁用在资源树中的资源一侧显示树状线。

source: Show verbose compiler output: Checking this will force the compiler to show extra commands related to the compilation process.
zh_cn: 显示详细的编译器输出: 勾选此选项会显示与编译进程相关的额外命令。

source: Show welcome screen on startup: This is on by default and simply tells GameMaker Studio 2 to show a brief splash screen when you start the program.
zh_cn: 在启动时显示欢迎页面：该选项默认为开，并且只是要求GameMaker Studio 2在启动程序的时候显示一个简短的启动画面。

source: Size of points - Set the size of the different nodes and control points to be used.
zh_cn: 点大小（Size of points） - 设置各个节点与控制点的大小。

source: Size: The size to set the font to for the given output window.
zh_cn: 大小（Size）: 用于所给定的输出窗口的字体大小。

source: Slow double click time (ms): Some areas of the IDE require a slower double click to work correctly, for example when renaming a resource (a fast double click will open the resource editor, while a slow double click will permit you to rename it).
zh_cn: 双击延迟时间（毫秒）: IDE中的某些位置要求一次较慢的双击才能发挥作用，比如重命名一个资源（快速双击会打开该资源的编辑器，而慢双击才允许你为它重命名）。

source: Snap To Grid - If this is checked then the image editor will automatically snap certain tools to the image grid.
zh_cn: 对齐网格 - 如果勾选此项，图像编辑器就会自动地将某些工具吸附到网格上。

source: Snap to grid - With this option you can set whether a room will have assets snap to the room grid by default or not when a room is initially opened.
zh_cn: 对齐到网格 - 使用这个选项你可以设置当一个房间初始化打开时是否默认将资源对齐到房间网格。

source: Social Media Icons - these take you to the various YoYo Games social media sites where you can keep up to date with news about GameMaker Studio 2
zh_cn: 社会媒体图标（Social Media Icons） - 这些将你带到各种YoYo Games的社会媒体网站，那里有 GameMaker Studio 2到目前为止最新的消息。

source: Sound Mixer - View the Sound Mixer window.
zh_cn: 混音器 - 查看 混音器 窗口。

source: Sounds - 10 (no audio buffers permitted)
zh_cn: 声音（Sounds） - 10 （不允许使用音频缓冲区）

source: Sprite double click opens image editor: By default double clicking on any resource will open that resource for editing, but often when dealing with sprites, after the initial setup when you create the new resource, you open it to edit the image rather than the sprite properties.
zh_cn: 双击精灵打开图片编辑器: 默认情况下，双击 任何资源都将打开该资源的编辑器，但对于精灵，在创建新资源并初始设置后，双击打开它进入编辑图像界面而不是编辑精灵属性。

source: Sprites - 20 (no dynamic loading permitted, no SWF or Spine sprites permitted)
zh_cn: 精灵（Sprites） - 20 （不允许动态载入，不允许使用SWF或Spine精灵）

source: Start Page - This will open a new Start Page workspace.
zh_cn: 起始页 - 该选项会打开一个新的起始页工作区

source: Style: The font style to use, like bold or italics (note that not all windows will permit the same styles and it will also depend on the font used).
zh_cn: 字体样式（Style）：所使用的字体样式，比如粗体（Bold）或斜体（Italic）（请注意，不是所有窗口都会允许相同的字体样式，并且这也取决于所使用的字体）。

source: Support Forums - Clicking this will take you to the Official GameMaker Studio 2 Support Forums on the YoYo Games Knowledge Base.
zh_cn: 论坛支持（Support Forums） - 点击该选项将会带您到YoYo Games知识库GameMaker Studio 2官方支持论坛。

source: Syntax checking delay (ms) - The delay time (in milliseconds) before the syntax checker runs.
zh_cn: 语法检查延迟（毫秒） - 语法检查之前延迟的时间（毫秒）。

source: Tab drag distance to un-maximise desktop (px): When you drag a workspace tab away from its default position within the IDE, if there is only one workspace active at that time then the GameMaker Studio 2 window will un-maximise and move with the mouse (if you have more than one workspace active a new instance of the IDE will be created to hold the workspace).
zh_cn: 非最大化桌面的选项卡拖动距离（像素）: 当你将工作区选项卡从IDE默认位置拖离时，如果此时只有一个工作区处于活动状态，那么 GameMaker Studio 2 窗口将取消最大化，并随着鼠标移动（如果有多个工作区处于活动状态，将创建新的IDE实例来保持工作区）。

source: Tab size: The number of character spaces that pressing "Tab" should indent the code.
zh_cn: 单次Tab大小：按下“tab”键应该缩进代码的字符空格数量。

source: Tangent line colour - Set the colour for the lines linking the control points to the anchors.
zh_cn: 切线颜色 - 为连接控制点到锚点的线条设置颜色。

source: Temp Location: The location for saving all the temporary folders.
zh_cn: 临时文件位置（Temp Location）：该位置用于存储所有的临时文件夹。

source: Temp directory: The location for saving all the temporary folders.
zh_cn: 临时目录: 储存所有临时文件夹的位置。

source: Texture Groups - View the Texture Group window.
zh_cn: 纹理组 - 查看 纹理组 窗口。

source: Texture Swaps - This number shows how many times your game is swapping textures per game frame (the time it takes GameMaker Studio 2 to run all events is a game tick, and the number of game ticks per second is set by the room speed).
zh_cn: 纹理交换 - 这个数字显示你的游戏每个游戏帧（该时间是 GameMaker Studio 2 运行所有事件的统一时间，每秒钟的游戏帧数由房间速度决定）交换纹理的次数。

source: The Precision (in pixels) Required To Insert Point On A Path Segment - This sets the precision value (in pixels) for inserting points on a path, ie: the mouse must be within this range to insert the point rather than add a new one.
zh_cn: 在路径节点插入点的精度（像素） - 这个设置在路径上插入点的精度值（以像素为单位），即鼠标必须在范围内才能插入点，而不是添加新点。

source: The amount of spacing for depth between layers: When you create multiple layers in the room editor they are automatically assigned a depth based on their position within the layer list.
zh_cn: 层之间深度的间距（The amount of spacing for depth between layers）：房间编辑器创建多个层时，将会基于层列表的位置自动绑定一个深度。

source: The background colour to be shown behind autotiling tiles: This option sets the background colour within the tile set editor in the section for creating Auto Tiles.
zh_cn: 自动图块背景颜色: 此选项用来在创建自动图块的部分中设置图块集编辑器中的背景颜色。

source: The chain alpha at the falloff stop distance: Sets the final alpha value after the fade out falloff point for the chain alpha.
zh_cn: 衰减停止距离的链条透明度（The chain alpha at the falloff stop distance）：设置链条透明度淡出衰减点的最终透明度的值。

source: The colour for the default background layer added to new rooms: Sets the initial colour that will be selected as the default for a new background layer.
zh_cn: 添加到新房间的默认背景层颜色（The colour for the default background layer added to new rooms）：设置初始的颜色，选择作为默认新的背景层的颜色。

source: The degree range allowed when looking for a window using shortcuts: Within a workspace you can have multiple windows open for different objects and resources, and so to move around quickly between them you can use the keyboard shortcut + + <Arrow Keys> to move between them.
zh_cn: 使用快捷键浏览窗口时允许的角度范围（The degree range allowed when looking for a window using shortcuts）在一个工作区内你可能会打开多个不同物体和资源的窗口，并且为了快速地在它们之间移动，你会使用键盘快捷键 + + <方向键>来在他们之间切换移动。

source: The distance in pixels that the chain alpha begins to fade out: Sets the distance from the parent window for the chain link to fade out from.
zh_cn: 链条透明度开始淡出的像素距离（The distance in pixels that the chain alpha begins to fade out）：设置链条开始淡出的与父窗口的距离。

source: The distance in pixels that the chain alpha stops fading out: Sets the distance from the parent window for the chain link to end fading out to.
zh_cn: 链条透明度停止淡出的像素距离（The distance in pixels that the chain alpha stops fading out）：设置链条连接结束淡出的与父窗口的距离。

source: The initial setting for the Show Views button on opening a room: If you have views active within a room, this is shown by an outline where the view boundaries would be within the room, and the visibility of this area can be toggled using the dedicated button in the editor itself.
zh_cn: 打开的房间显示视野按钮的初始化设置（The initial setting for the Show Views button on opening a room）：如果一个房间里有激活的视野，这个可以通过房间里视野边界框可以看出来，这个区域是否可见可以通过专用的按钮进行切换。

source: The link colour for workspace chains: This is the colour that will be used to display chains between workspace elements.
zh_cn: 工作区中连接线的颜色（The link colour for workspace chains）：该颜色被用于显示工作区元素之间的连接线。

source: The padding between two columns in a chain: Workspace elements are often "chained" to each other (for example, the Code Editor is chained to the Event Editor is chained to the Object Editor), and this option permits you to set the horizontal distance between any two chained windows.
zh_cn: 连接线所连接两个栏目的间隔宽度（The padding between two columns in a chain）：工作区中的元素彼此之间通常被“连锁”起来（比如说，代码编辑器会被连接到事件编辑器，而事件编辑器再被连接到物体编辑器，这样就形成一个工作链（Work Chain）），那么该选项就允许你设置任意两个相连窗口的之间的水平距离。

source: The padding between two rows in a chain: As mentioned above, workspace elements are often "chained" to each other and this option permits you to set the vertical distance between any two chained windows.
zh_cn: 工作链的行距The padding between two rows in a chain：如前所述，工作区元素彼此通常都是被“连锁”起来的，该选项允许你设置任意两个相连窗口的纵向距离。

source: The properties frame colour for locked items in the room: Sets the colour of the frame that surrounds the asset properties that have been locked.
zh_cn: 房间里锁定项目的属性框的颜色（The properties frame colour for locked items in the room）： 设置环绕被锁定的资源的属性框的颜色。

source: The properties frame colour for unlocked items in the room: Sets the colour of the frame that surrounds the asset properties in the room editor that have not been locked.
zh_cn: 房间内未锁定项目的选择框的颜色（The properties frame colour for unlocked items in the room）：设置房间编辑器中环绕未锁定的资源的选择框的颜色。

source: Tile Sets - 2
zh_cn: 图块集（Tile Sets） - 2

source: Tile Sets are created from sprites, but they are also classified as a separate resources since the way that GameMaker Studio 2 handles them is a bit different to both sprites and objects.
zh_cn: 图块集 是以精灵为基础创建的，但是它们被分类为独立的资源，因为 GameMaker Studio 2 处理图块集的方式与精灵以及物体有点不同。

source: Time in milliseconds to hold the mouse down to drag nodes: When you click on a node and drag it, you will be repositioning the node within the action code.
zh_cn: 按住鼠标到拖动节点所需的毫秒时间（Time in milliseconds to hold the mouse down to drag nodes）：当你点击一个节点并拖拽时，你就会在动作代码中改变节点的位置。

source: Time in seconds to lock scrolling to a gadget: This option deals with the time that GameMaker Studio 2 should wait between scrolling windows that are overlapping.
zh_cn: 锁定部件滚动状态的时间（Time in seconds to lock scrolling to a gadget）###此处原文给的是秒（Seconds），但IDE中给出的是毫秒（milliseconds），因此Seconds被略过###：该选项用于处理GameMaker Studio 2在两个交叠窗口之间滚动的等待时间。

source: Timelines - 2 (no dynamic timeline creation permitted)
zh_cn: 时间轴（Timelines） - 2 （不允许创建动态时间轴）

source: To-do List - Opens the To-do List editor window.
zh_cn: To-do 列表 - 打开 To-do 列表 编辑器窗口。

source: Transparent background block size - When you have selected Block Pattern for the background, you can set the size of the individual block here.
zh_cn: 透明背景块大小（Transparent background block size） - 当你选择方块图案作为背景时，你可以在这里设置每个方块的尺寸。

source: Transparent background colour 1 - If you have Single Colour chosen for the background, then the colour used is this one.
zh_cn: 透明背景色 1（Transparent background colour 1） - 如果你为背景选择了单色模式，那么就会使用这个颜色。

source: Transparent background colour 2 - If you have Block Pattern chosen for the background, then the colour used to alternate with colour 1 (above) is this one.
zh_cn: 透明背景色 2（Transparent background colour 2） - 如果你选择了方块图案作为背景，那么这个颜色就是与颜色 1（上文所述）相交替搭配的另一个颜色。

source: Transparent background style - Here you set the "style" for the background, which can either be "Block Pattern" or "Single Colour".
zh_cn: 透明背景样式（Transparent background style） - 这里你可以设置透明背景的显示“样式”，可以为方块图案（Block Pattern），也可以为单色模式（Single Colour）。

source: Tree line colour: The colour that will be used to draw the tree lines between different resource nodes.
zh_cn: 树状线颜色: 将用于绘制不同资源节点之间的树状线的颜色。

source: Ubuntu (Linux) - Ubuntu (Linux) apps can be compiled as *.zip files.
zh_cn: Ubuntu (Linux) - Ubuntu（Linux）应用程序可以编译为 * .zip 文件。

source: Undo / Redo Stack Limit: Here you can set the Undo/Redo stack limit.
zh_cn: 撤消/重做堆栈限制（<0 无限制）：在这里你可以设置撤消/重做的堆栈限制。

source: Undo - Undo an action.
zh_cn: 撤销（Undo） - 撤销一步动作。

source: Update Existing Package - This option will open the Update Package Wizard so you can update an existing Marketplace package that you have previously created.
zh_cn: 更新现有的资源包 - 该选项将会打开 资源包更新向导（Update Package Wizard）以便你能够更新一个现有的市场资源包。

source: Use an external browser for help: If this is checked then opening the help file will open it using the default browser for your system.
zh_cn: 使用外部浏览器获取帮助: 如果勾选此选项将使用系统默认浏览器打开帮助文档。

source: Use external browser for help: If this is checked then opening the help file will open it using the default browser for your system.
zh_cn: 使用外部浏览器打开帮助文件（Use external browser for help）：如果勾选此项，则以后会使用你系统上的默认浏览器打开帮助文件。

source: Username to commit as: Here you must enter the username that you will be using to do any commits to Git with (this must be the same as the username specified when you set up your Git repository).
zh_cn: 提交的用户名：在这里你必须输入你将做任何提交到Gi时所使用的用户名（它必须同Git仓库所指定的用户名一致）。

source: VM: The VM (Virtual Machine) target uses a generic runner for each platform and then interprets the code for your game.
zh_cn: 虚拟机：虚拟机使用每个平台的通用 运行 程序来编译您的游戏代码。

source: Verbose Logging: Enable verbose logging for the Git output log.
zh_cn: 启用详细日志记录（Verbose Logging）：Git 启用详细日志记录输出日志。

source: Vertex Batches - This is how many times the game is sending off texture batches to the GPU per game frame, and (as with Texture Swaps) you want this to be as low as possible.
zh_cn: 顶点批次 - 这是每个游戏帧游戏将纹理批次发送到GPU的次数，以及（与纹理交换）一样，您会希望这个值尽可能低。

source: Vertical pixel spacing - This value sets the spacing for the vertical lines of the image grid.
zh_cn: 垂直像素间隔（Vertical Pixel Spacing） - 该值设置图像编辑器网格的垂直线间距。

source: Vertical pixel spacing - This will set the vertical space for gird cells of the room grid in pixels.
zh_cn: 垂直像素间距（Vertical pixel spacing） - 这将以像素为单位设置房间网格的单元格垂直间距。

source: WARNING!: If the array has over 32,000 entries this function will return an erroneous value and should not be used.
zh_cn: 警告！：如果该数组具有32000个以上的元素，该函数将会返回一个无法使用的错误的值。

source: Welcome Page - This will open athe initial welcome page slide show in a new workspace.
zh_cn: 欢迎页 - 该选项将会在一个新的工作区内打开一个初始欢迎滑动页面。

source: What is the default Toolbox location?: By default the DnD toolbox (where all the different action libraries are held) is placed on the right of the Editor, but you can use this option to have it default to the left.
zh_cn: 默认状态下工具箱的位置？（What is the default Toolbox location?）：默认状态下DnD的工具箱（持有各种动作库）会出现在编辑器的右侧，但是你可以使用这个选项来让他出现在左侧。

source: When does the overview appear next to a node?: A node "overview" is the short descriptive text that appears beside certain actions in the Action Workspace, for example this Destroy Instance action: You can choose to enable these always, enable them only if the action is collapsed (the default setting), or disable them altogether.
zh_cn: 概览图什么时候出现在节点的旁边？（When does the overview appear next to a node?）：一个节点的“概览”是出现在某个动作工作区中某个动作旁边的一段简短的描述性文字，比如这个销毁实例（Destroy Instance）动作：你可以选择启用一直显示、启用它们在动作块折叠时候显示（默认）或者是禁止它们显示。

source: Whether we should reset back to 1:1 when moving between windows using shortcuts: As mentioned above, you can skip from window to window within the workspace using keyboard shortcuts.
zh_cn: 使用快捷键在窗口间移动时，我们是否应该重置回1:1（Whether we should reset back to 1:1 when moving between windows using shortcuts）：如前所述，你可以在工作区中通过使用键盘快捷键在窗口之间跳转。

source: White - GPU left over time, which is the time spent waiting for the GPU to finish the rendering of the frame before the next one can start
zh_cn: 白色 - GPU 剩余时间，这是 GPU 在下一个画面可以开始渲染之前完成当前画面渲染所花费的时间

source: Window: This menu contains options for the various sub-windows that you can create for debugging.
zh_cn: Window:在这个菜单中包含你能在调试的时候生成的多种子窗口的选项。

source: Window - Window shortcuts are those that are specific to a single window or tab, unless a gadget shortcut overrides it.
zh_cn: 窗口 - 窗口快捷键是那些专门用于单独窗口或标签页的快捷键，除非部件的快捷键覆盖了该快捷键。

source: Windows UWP - For Windows UWP, GameMaker Studio 2 will create an *.appx package which can then be uploaded to the Windows Store.
zh_cn: Windows UWP - 对于 Windows UWP，GameMaker Studio 2 将创建 *.appx 包，然后可以将其上传到 Windows Store。

source: Windows - Compiling for the general Windows OS will first request that you choose between creating an Installer or a Zip package, where the installer will be a single executable that will install your game, and the Zip file will be a single zip format compressed file with all your game files stored within (the files will need extracted for the game to run).
zh_cn: Windows - 一般Windows操作系统的编译首先会要求您在创建 安装程序 或 Zip 程序包之间进行选择，安装程序将是安装游戏的单个可执行程序，Zip 文件将是单个的 zip 格式压缩文件， 其中包含所有的游戏文件（游戏运行时文件需要从其中提取）。

source: Workspace chain column padding (px): Workspace elements are often "chained" to each other (for example, the Code Editor is chained to the Event Editor is chained to the Object Editor), and this option permits you to set the horizontal distance between any two chained windows.
zh_cn: 工作区连接线的面板之间的列间隔量（像素）: 工作区元素通常彼此“连接”（例如，代码编辑器连接到事件编辑器，而事件编辑器连接到物体编辑器），该选项设置任何两个连接窗口之间的水平距离。

source: Workspace chain link colour: This is the colour that will be used to display chains between workspace elements.
zh_cn: 工作区连接线颜色: 设置工作区连接线的颜色。

source: Workspace chain rendering segment count: Here you can set the maximum number of segments for render chains.
zh_cn: 工作区连接线渲染段数量: 这里可以设置渲染工作区连接线的最大段数。

source: Workspace chain row padding (px): As mentioned above, workspace elements are often "chained" to each other and this option permits you to set the vertical distance between any two chained windows.
zh_cn: 工作区连接线的面板之间的行间隔量（像素）: 如上所述，工作区元素通常彼此“连接”，该选项设置任何两个连接窗口之间的垂直距离。

source: Workspace chains can overlap: When enabled this option will permit workspace chains to cross and overlap.
zh_cn: 允许工作区连接线交叉: 当启用该选项时允许工作区连接线交叉和重叠。

source: Workspace keyboard navigation degree range: Within a workspace you can have multiple windows open for different objects and resources, and so to move around quickly between them you can use the keyboard shortcut / + + <Arrow Keys> to move between them.
zh_cn: 工作区键盘导航度范围: 在工作区中，你可以为不同的物体和资源打开多个窗口，因此为了在它们之间快速移动，可以使用 键盘快捷键 / + + <方向键> 在它们之间移动。

source: Workspace keyboard navigation resets zoom: As mentioned above, you can skip from window to window within the workspace using keyboard shortcuts.
zh_cn: 工作区键盘导航会重置缩放: 如上所述，可以使用键盘快捷键在工作区内的窗口间跳动。

source: YYC: The YYC (YoYo Compiler) takes the normal GameMaker Studio 2 output and compiles it into native code for the target platform, "stripping out" unneeded functions and performing a host of other optimisation techniques to create a smaller and performance enhanced executable.
zh_cn: YYC：YYC（YoYo编译器）采用 GameMaker Studio 2 输出，并将其编译为 本地 代码，“剥离”一些不需要的功能，并执行大量的优化技术来创建更小和性能更强的可执行文件

source: Yellow - The time required for the draw event
zh_cn: 黄色 - 绘制事件所需的时间

source: YoYo Games - takes you to the main YoYo Games website
zh_cn: YoYo Games -将你带到YoYo Games 官方网站。

source: YoYoGames.com - Opens the main YoYo Games homepage.
zh_cn: YoYoGames 官网 - 打开 YoYo Games 主页。

source: a++ will increment the variable but return the value before it was incremented.
zh_cn: a++ 递增变量但是返回增加前的值。

source: iOS - Compiling to iOS will create an xarchive file which is then used in Xtools to create the final iOS package.
zh_cn: iOS - 编译到 iOS 将创建一个 xarchive 文件，然后在 Xtools 中创建最终的 iOS 包。
